# YOLOv5s

# Parameters
nc: 80  # number of classes
# 控制模型大小
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3    # 自动分配锚框
## 不同大小的锚来为不同大小的物体提供先验信息，P3-5是图像金字塔的不同层，用多尺度特征融合，越小的特征层感受野越大，用来检测大尺寸目标
#  - [10,13, 16,30, 33,23]  # P3/8 原图大小1/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # from：数据来源-1表示为上一层的输出
  # number：layer重复次数
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 xsmall  64
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8 small   128
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16 middle  256
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32 large   384
   [-1, 3, C3, [768]],
   # add
   [ -1, 1, Conv, [ 1024, 3, 2 ] ],  # 9-P6/32 xlarge  512
   [ -1, 3, C3, [ 1024 ] ],

   [-1, 1, SPPF, [1024, 5]],  # 11
  ]

# YOLOv5 v6.0 head
head:
  # add
  [[-1, 1, Conv, [768, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5
   [-1, 3, C3, [768, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 19

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 23
  # add
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 3, C3, [128, False]],  # 27 (P2/4-xsmall)
  # add
   [ -1, 1, Conv, [ 128, 3, 2 ] ],
   [ [ -1, 24 ], 1, Concat, [ 1 ] ],  # cat head P3 在采样前的conv
   [ -1, 3, C3, [ 256, False ] ],  # 30 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 33 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [768, False]],  # 36 (P5/32-large)
  # add
   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P6
   [-1, 3, C3, [1024, False]],  # 39 (P5/32-large)

   [[27, 30, 33, 36, 39], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
